# HostTopologyChange Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarFailures..::..HostTopologyChange Property
BuiltInFailures..::..RebarFailures Class See Also
---
A reinforced host has undergone a major change. The reinforcement must be removed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId HostTopologyChange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HostTopologyChange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ HostTopologyChange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarFailures Class
Autodesk.Revit.DB Namespace